NetologySlow/src/Documents/УстановкаСкидок/УстановкаСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСкидок</name>
  <registerRecords>InformationRegister.Скидки</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>НоменклатураНоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

NetologySlow/src/Documents/УстановкаСкидок/Forms/ФормаДокумента/Module.bsl
//Создать клиентскую процедуру ПриИзмененииНоменклатурыНоменклатурнойГруппы 
 //с параметром ИзмененнаяСтрока (ДанныеФормыЭлементКоллекции), 
 //в которой, если НоменклатураНоменклатурнаяГруппа заполнена, вызвать ЦеныВызовСервера.ЦенаНаДату и заполнить скидку.

&НаКлиенте
Процедура СкидкиНоменклатураНоменклатурнаяГруппаПриИзменении(Элемент) //1.0 Скидка	
	//вызвать процедуру ПриИзмененииНоменклатурыНоменклатурнойГруппы с передачей текущих данных таблицы скидок.
	 ИзмененнаяСтрока=Элементы.Скидки.ТекущиеДанные;
	 ПриИзмененииНоменклатурыНоменклатурнойГруппы(ИзмененнаяСтрока); 
	
КонецПроцедуры    

 &НаКлиенте
Процедура ПриИзмененииНоменклатурыНоменклатурнойГруппы (ИзмененнаяСтрока)  //1.1 Скидка
	 
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа) Тогда  
		НоменклатураНоменклатурнаяГруппа=ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа; 
		Дата=Объект.Дата; 
		СкидкаНоменклатуры=ЦеныВызовСервера.СкидкаНаДату(НоменклатураНоменклатурнаяГруппа, Дата); 
		ИзмененнаяСтрока.Скидка=СкидкаНоменклатуры; 
		
	 КонецЕсли;    
	 
КонецПроцедуры 

&НаКлиенте
Процедура Подбор(Команда)
	 ПараметрыФормы=Новый Структура; 
	 ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь); 
	 ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",ПараметрыФормы,Элементы.Скидки);  //Не разобрался что написать, чтобы выбирало и номенклатуру и Ном.группу
КонецПроцедуры

&НаКлиенте
Процедура СкидкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;  
    //если в таблице еще нет выбранного значения - добавить строку и вызвать процедуру ПриИзмененииНоменклатурыНоменклатурнойГруппы, передав добавленную строку. 
    ЭлементВыбора=Новый Структура; 
    ЭлементВыбора.Вставить("НоменклатураНоменклатурнаяГруппа",ВыбранноеЗначение); 
    Результат=Объект.Скидки.НайтиСтроки(ЭлементВыбора); 
    
    Если Результат.Количество()=0 Тогда
    	ИзмененнаяСтрока=Объект.Скидки.Добавить(); 
    	ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа=ВыбранноеЗначение; 
    	ПриИзмененииНоменклатурыНоменклатурнойГруппы (ИзмененнаяСтрока);  
    Иначе Сообщить(СтрШаблон("Номенклатура %1 уже есть в списке", ВыбранноеЗначение)); 
    КонецЕсли; 

КонецПроцедуры


 //  &НаКлиенте
 //Процедура Подбор(Команда)  //3
 //    
 //    //открыть //форму выбора справочника Номенклатура// с параметром ЗакрыватьПриВыборе = Ложь, указав в качестве владельца таблицу цен.  
 //    ПараметрыФормы=Новый Структура; 
 //    ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь); 
 //    ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",ПараметрыФормы,Элементы.Цены); 
 //    
 //КонецПроцедуры
 //
 //&НаКлиенте
 //Процедура ЦеныОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)     //4
 //   СтандартнаяОбработка=Ложь;  
 //   //если в таблице еще нет выбранного значения - добавить строку и вызвать процедуру ПриИзмененииНоменклатуры, передав добавленную строку. 
 //   ЭлементВыбора=Новый Структура; 
 //   ЭлементВыбора.Вставить("Номенклатура",ВыбранноеЗначение); 
 //   Результат=Объект.Цены.НайтиСтроки(ЭлементВыбора); 
 //   
 //   Если Результат.Количество()=0 Тогда
 //   	ИзмененнаяСтрока=Объект.Цены.Добавить(); 
 //   	ИзмененнаяСтрока.Номенклатура=ВыбранноеЗначение; 
 //   	ПриИзмененииНоменклатуры(ИзмененнаяСтрока);  
 //   Иначе Сообщить(СтрШаблон("Номенклатура %1 уже есть в списке", ВыбранноеЗначение)); 
 //   КонецЕсли; 
 //КонецПроцедуры
